wrkProfiler/wrk/wrk-stage-6.txt
+++++++++++++++++++++++++++++++++++++++++++++PUT++++++++++++++++++++++++++++++++++++++++++++

PUT (25 connections) 

wrk -t4 -c25 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 25 connections
  Thread calibration: mean lat.: 112.250ms, rate sampling interval: 1061ms
  Thread calibration: mean lat.: 95.762ms, rate sampling interval: 1036ms
  Thread calibration: mean lat.: 91.909ms, rate sampling interval: 999ms
  Thread calibration: mean lat.: 120.299ms, rate sampling interval: 1084ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.20ms   96.36ms   1.00s    97.51%
    Req/Sec    93.43     19.25   162.00     74.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.29ms
 90.000%    1.66ms
 99.000%  650.75ms
 99.900%  977.92ms
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.475     0.000000            1         1.00
       0.594     0.100000         1885         1.11
       0.730     0.200000         3756         1.25
       0.831     0.300000         5627         1.43
       0.929     0.400000         7513         1.67
       0.997     0.500000         9400         2.00
       1.030     0.550000        10321         2.22
       1.071     0.600000        11245         2.50
       1.134     0.650000        12185         2.86
       1.210     0.700000        13119         3.33
       1.292     0.750000        14057         4.00
       1.346     0.775000        14523         4.44
       1.410     0.800000        14994         5.00
       1.464     0.825000        15465         5.71
       1.516     0.850000        15935         6.67
       1.569     0.875000        16398         8.00
       1.608     0.887500        16631         8.89
       1.663     0.900000        16867        10.00
       1.741     0.912500        17099        11.43
       1.898     0.925000        17333        13.33
       2.199     0.937500        17567        16.00
       2.485     0.943750        17684        17.78
       2.823     0.950000        17802        20.00
       3.387     0.956250        17919        22.86
       4.711     0.962500        18036        26.67
       7.715     0.968750        18153        32.00
      17.055     0.971875        18211        35.56
     110.335     0.975000        18270        40.00
     209.663     0.978125        18329        45.71
     325.375     0.981250        18387        53.33
     441.087     0.984375        18447        64.00
     508.671     0.985938        18475        71.11
     557.567     0.987500        18504        80.00
     611.839     0.989062        18534        91.43
     674.303     0.990625        18564       106.67
     722.431     0.992188        18592       128.00
     766.975     0.992969        18609       142.22
     790.527     0.993750        18622       160.00
     814.079     0.994531        18636       182.86
     838.143     0.995313        18651       213.33
     865.279     0.996094        18665       256.00
     884.735     0.996484        18674       284.44
     907.263     0.996875        18680       320.00
     908.287     0.997266        18688       365.71
     931.327     0.997656        18698       426.67
     935.423     0.998047        18702       512.00
     954.367     0.998242        18710       568.89
     954.367     0.998437        18710       640.00
     955.391     0.998633        18713       731.43
     977.919     0.998828        18722       853.33
     977.919     0.999023        18722      1024.00
     977.919     0.999121        18722      1137.78
     978.431     0.999219        18724      1280.00
     979.455     0.999316        18726      1462.86
    1000.959     0.999414        18732      1706.67
    1000.959     0.999512        18732      2048.00
    1000.959     0.999561        18732      2275.56
    1000.959     0.999609        18732      2560.00
    1000.959     0.999658        18732      2925.71
    1001.471     0.999707        18735      3413.33
    1001.471     0.999756        18735      4096.00
    1001.471     0.999780        18735      4551.11
    1001.471     0.999805        18735      5120.00
    1001.471     0.999829        18735      5851.43
    1001.983     0.999854        18738      6826.67
    1001.983     1.000000        18738          inf
#[Mean    =       15.198, StdDeviation   =       96.361]
#[Max     =     1001.472, Total count    =        18738]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22504 requests in 1.00m, 1.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 435
  Non-2xx or 3xx responses: 14
Requests/sec:    375.06
Transfer/sec:     24.54KB



PUT(75 connections)



wrk -t4 -c75 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 75 connections
  Thread calibration: mean lat.: 1.257ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.288ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 12.328ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 17.833ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.12ms   45.09ms   1.00s    99.45%
    Req/Sec   107.61     82.22     1.78k    48.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.39ms
 90.000%    1.69ms
 99.000%    5.24ms
 99.900%  859.14ms
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.411     0.000000            1         1.00
       0.597     0.100000         2052         1.11
       0.733     0.200000         4064         1.25
       0.829     0.300000         6109         1.43
       0.913     0.400000         8135         1.67
       1.052     0.500000        10166         2.00
       1.114     0.550000        11183         2.22
       1.193     0.600000        12204         2.50
       1.269     0.650000        13214         2.86
       1.332     0.700000        14224         3.33
       1.392     0.750000        15249         4.00
       1.431     0.775000        15749         4.44
       1.463     0.800000        16272         5.00
       1.492     0.825000        16771         5.71
       1.532     0.850000        17273         6.67
       1.597     0.875000        17790         8.00
       1.642     0.887500        18036         8.89
       1.687     0.900000        18292        10.00
       1.734     0.912500        18543        11.43
       1.790     0.925000        18799        13.33
       1.848     0.937500        19050        16.00
       1.889     0.943750        19178        17.78
       1.944     0.950000        19305        20.00
       2.025     0.956250        19431        22.86
       2.163     0.962500        19559        26.67
       2.383     0.968750        19686        32.00
       2.477     0.971875        19748        35.56
       2.639     0.975000        19812        40.00
       2.851     0.978125        19876        45.71
       3.097     0.981250        19939        53.33
       3.397     0.984375        20002        64.00
       3.593     0.985938        20034        71.11
       4.061     0.987500        20066        80.00
       4.799     0.989062        20098        91.43
       5.771     0.990625        20129       106.67
       8.131     0.992188        20161       128.00
      10.111     0.992969        20177       142.22
      13.007     0.993750        20193       160.00
      72.767     0.994531        20208       182.86
     215.679     0.995313        20225       213.33
     358.655     0.996094        20244       256.00
     429.823     0.996484        20248       284.44
     500.991     0.996875        20256       320.00
     572.415     0.997266        20264       365.71
     644.095     0.997656        20272       426.67
     715.263     0.998047        20280       512.00
     716.287     0.998242        20286       568.89
     786.943     0.998437        20290       640.00
     787.455     0.998633        20294       731.43
     858.623     0.998828        20298       853.33
     859.135     0.999023        20302      1024.00
     859.135     0.999121        20302      1137.78
     929.791     0.999219        20305      1280.00
     930.303     0.999316        20310      1462.86
     930.303     0.999414        20310      1706.67
     930.303     0.999512        20310      2048.00
     931.839     0.999561        20311      2275.56
    1001.471     0.999609        20315      2560.00
    1001.471     0.999658        20315      2925.71
    1001.471     0.999707        20315      3413.33
    1001.471     0.999756        20315      4096.00
    1001.471     0.999780        20315      4551.11
    1001.983     0.999805        20318      5120.00
    1001.983     0.999829        20318      5851.43
    1001.983     0.999854        20318      6826.67
    1001.983     0.999878        20318      8192.00
    1001.983     0.999890        20318      9102.22
    1001.983     0.999902        20318     10240.00
    1001.983     0.999915        20318     11702.86
    1001.983     0.999927        20318     13653.33
    1001.983     0.999939        20318     16384.00
    1001.983     0.999945        20318     18204.44
    1003.519     0.999951        20319     20480.00
    1003.519     1.000000        20319          inf
#[Mean    =        4.117, StdDeviation   =       45.093]
#[Max     =     1003.008, Total count    =        20319]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  25821 requests in 1.00m, 1.65MB read
  Socket errors: connect 0, read 0, write 0, timeout 1164
  Non-2xx or 3xx responses: 13
Requests/sec:    430.23
Transfer/sec:     28.15KB



PUT(128 connections)


wrk -t4 -c128 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 128 connections
  Thread calibration: mean lat.: 3.467ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.565ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.571ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 13.851ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.45ms   38.34ms   1.00s    99.63%
    Req/Sec   147.32    106.89     1.11k    65.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.47ms
 90.000%    1.72ms
 99.000%    7.73ms
 99.900%  749.05ms
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.446     0.000000            1         1.00
       0.771     0.100000         2801         1.11
       0.899     0.200000         5570         1.25
       1.013     0.300000         8341         1.43
       1.118     0.400000        11126         1.67
       1.232     0.500000        13896         2.00
       1.283     0.550000        15286         2.22
       1.327     0.600000        16670         2.50
       1.369     0.650000        18081         2.86
       1.416     0.700000        19464         3.33
       1.465     0.750000        20833         4.00
       1.489     0.775000        21541         4.44
       1.516     0.800000        22242         5.00
       1.546     0.825000        22919         5.71
       1.591     0.850000        23614         6.67
       1.647     0.875000        24304         8.00
       1.679     0.887500        24655         8.89
       1.724     0.900000        25003        10.00
       1.783     0.912500        25346        11.43
       1.880     0.925000        25693        13.33
       2.031     0.937500        26042        16.00
       2.165     0.943750        26217        17.78
       2.341     0.950000        26393        20.00
       2.551     0.956250        26561        22.86
       2.923     0.962500        26735        26.67
       3.473     0.968750        26908        32.00
       3.793     0.971875        26995        35.56
       4.143     0.975000        27082        40.00
       4.587     0.978125        27169        45.71
       5.063     0.981250        27256        53.33
       5.695     0.984375        27342        64.00
       6.119     0.985938        27386        71.11
       6.675     0.987500        27429        80.00
       7.451     0.989062        27473        91.43
       8.191     0.990625        27516       106.67
       9.575     0.992188        27561       128.00
      10.159     0.992969        27581       142.22
      10.983     0.993750        27603       160.00
      12.015     0.994531        27625       182.86
      14.015     0.995313        27646       213.33
      23.151     0.996094        27668       256.00
     109.631     0.996484        27679       284.44
     236.799     0.996875        27690       320.00
     363.775     0.997266        27701       365.71
     385.791     0.997656        27711       426.67
     494.591     0.998047        27722       512.00
     619.007     0.998242        27729       568.89
     619.519     0.998437        27733       640.00
     746.495     0.998633        27740       731.43
     747.007     0.998828        27747       853.33
     749.055     0.999023        27749      1024.00
     873.983     0.999121        27755      1137.78
     873.983     0.999219        27755      1280.00
     874.495     0.999316        27760      1462.86
     874.495     0.999414        27760      1706.67
     880.639     0.999512        27763      2048.00
    1000.959     0.999561        27765      2275.56
    1001.471     0.999609        27772      2560.00
    1001.471     0.999658        27772      2925.71
    1001.471     0.999707        27772      3413.33
    1001.471     0.999756        27772      4096.00
    1001.471     0.999780        27772      4551.11
    1001.471     0.999805        27772      5120.00
    1001.471     0.999829        27772      5851.43
    1001.471     0.999854        27772      6826.67
    1001.983     0.999878        27776      8192.00
    1001.983     1.000000        27776          inf
#[Mean    =        3.455, StdDeviation   =       38.339]
#[Max     =     1001.472, Total count    =        27776]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  34142 requests in 1.00m, 2.18MB read
  Socket errors: connect 0, read 0, write 0, timeout 1564
  Non-2xx or 3xx responses: 21
Requests/sec:    567.52
Transfer/sec:     37.14KB


++++++++++++++++++++++++++++++++++++++++++++++++++GET +++++++++++++++++++++++++++++++++++++++++++++

GET(25 connections)


wrk -t4 -c25 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  4 threads and 25 connections
  Thread calibration: mean lat.: 394.662ms, rate sampling interval: 2826ms
  Thread calibration: mean lat.: 718.684ms, rate sampling interval: 3692ms
  Thread calibration: mean lat.: 491.379ms, rate sampling interval: 1944ms
  Thread calibration: mean lat.: 251.870ms, rate sampling interval: 1699ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   317.58ms  535.57ms   2.71s    86.40%
    Req/Sec    79.04     30.92   132.00     57.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.04ms
 75.000%  481.54ms
 90.000%  964.61ms
 99.000%    2.37s 
 99.900%    2.65s 
 99.990%    2.71s 
 99.999%    2.71s 
100.000%    2.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.255     0.000000            1         1.00
      20.383     0.100000         1978         1.11
      20.495     0.200000         3403         1.25
      20.687     0.300000         5024         1.43
      20.991     0.400000         7102         1.67
      21.039     0.500000         8572         2.00
      21.087     0.550000         9308         2.22
      21.519     0.600000        10040         2.50
     101.823     0.650000        10875         2.86
     294.655     0.700000        11711         3.33
     481.535     0.750000        12548         4.00
     568.831     0.775000        12967         4.44
     653.823     0.800000        13386         5.00
     733.695     0.825000        13805         5.71
     812.031     0.850000        14221         6.67
     886.783     0.875000        14639         8.00
     925.183     0.887500        14848         8.89
     964.607     0.900000        15059        10.00
    1009.151     0.912500        15268        11.43
    1197.055     0.925000        15476        13.33
    1380.351     0.937500        15685        16.00
    1477.631     0.943750        15789        17.78
    1587.199     0.950000        15894        20.00
    1699.839     0.956250        15999        22.86
    1808.383     0.962500        16104        26.67
    1935.359     0.968750        16208        32.00
    1998.847     0.971875        16260        35.56
    2062.335     0.975000        16312        40.00
    2127.871     0.978125        16365        45.71
    2187.263     0.981250        16417        53.33
    2250.751     0.984375        16469        64.00
    2283.519     0.985938        16496        71.11
    2316.287     0.987500        16522        80.00
    2349.055     0.989062        16550        91.43
    2377.727     0.990625        16574       106.67
    2410.495     0.992188        16600       128.00
    2430.975     0.992969        16613       142.22
    2455.551     0.993750        16627       160.00
    2478.079     0.994531        16639       182.86
    2502.655     0.995313        16652       213.33
    2525.183     0.996094        16665       256.00
    2541.567     0.996484        16673       284.44
    2551.807     0.996875        16679       320.00
    2562.047     0.997266        16685       365.71
    2574.335     0.997656        16691       426.67
    2594.815     0.998047        16698       512.00
    2607.103     0.998242        16701       568.89
    2617.343     0.998437        16704       640.00
    2631.679     0.998633        16708       731.43
    2643.967     0.998828        16711       853.33
    2654.207     0.999023        16714      1024.00
    2662.399     0.999121        16716      1137.78
    2666.495     0.999219        16717      1280.00
    2672.639     0.999316        16719      1462.86
    2680.831     0.999414        16721      1706.67
    2684.927     0.999512        16722      2048.00
    2689.023     0.999561        16723      2275.56
    2691.071     0.999609        16724      2560.00
    2695.167     0.999658        16725      2925.71
    2699.263     0.999707        16726      3413.33
    2699.263     0.999756        16726      4096.00
    2703.359     0.999780        16727      4551.11
    2703.359     0.999805        16727      5120.00
    2707.455     0.999829        16728      5851.43
    2707.455     0.999854        16728      6826.67
    2707.455     0.999878        16728      8192.00
    2709.503     0.999890        16729      9102.22
    2709.503     0.999902        16729     10240.00
    2709.503     0.999915        16729     11702.86
    2709.503     0.999927        16729     13653.33
    2709.503     0.999939        16729     16384.00
    2713.599     0.999945        16730     18204.44
    2713.599     1.000000        16730          inf
#[Mean    =      317.575, StdDeviation   =      535.569]
#[Max     =     2711.552, Total count    =        16730]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  20111 requests in 1.00m, 1.36MB read
  Socket errors: connect 0, read 0, write 0, timeout 462
  Non-2xx or 3xx responses: 28
Requests/sec:    335.15
Transfer/sec:     23.17KB


wrk -t4 -c75 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  4 threads and 75 connections
  Thread calibration: mean lat.: 51.009ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 51.583ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 66.543ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 20.600ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.22ms  130.55ms   1.00s    95.61%
    Req/Sec    45.22     28.87   170.00     82.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.38ms
 75.000%   20.59ms
 90.000%   21.41ms
 99.000%  845.82ms
 99.900%    1.00s 
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.271     0.000000            7         1.00
      20.319     0.100000         1241         1.11
      20.335     0.200000         2257         1.25
      20.351     0.300000         3198         1.43
      20.367     0.400000         3958         1.67
      20.383     0.500000         4570         2.00
      20.399     0.550000         5112         2.22
      20.415     0.600000         5508         2.50
      20.431     0.650000         5847         2.86
      20.479     0.700000         6405         3.33
      20.591     0.750000         6747         4.00
      21.055     0.775000         6959         4.44
      21.311     0.800000         7255         5.00
      21.327     0.825000         7453         5.71
      21.343     0.850000         7651         6.67
      21.375     0.875000         7952         8.00
      21.391     0.887500         8035         8.89
      21.407     0.900000         8120        10.00
      21.439     0.912500         8243        11.43
      21.487     0.925000         8323        13.33
      21.743     0.937500         8418        16.00
      24.431     0.943750         8474        17.78
      72.127     0.950000         8531        20.00
     202.623     0.956250         8587        22.86
     328.959     0.962500         8648        26.67
     432.383     0.968750         8699        32.00
     484.351     0.971875         8729        35.56
     536.063     0.975000         8756        40.00
     587.775     0.978125         8783        45.71
     667.135     0.981250         8811        53.33
     742.399     0.984375         8851        64.00
     742.911     0.985938         8856        71.11
     794.111     0.987500         8877        80.00
     795.135     0.989062         8881        91.43
     845.823     0.990625         8903       106.67
     897.535     0.992188         8929       128.00
     897.535     0.992969         8929       142.22
     897.535     0.993750         8929       160.00
     898.047     0.994531         8930       182.86
     949.247     0.995313         8954       213.33
     949.247     0.996094         8954       256.00
     949.247     0.996484         8954       284.44
     949.247     0.996875         8954       320.00
     974.847     0.997266         8955       365.71
    1000.959     0.997656         8979       426.67
    1000.959     1.000000         8979          inf
#[Mean    =       47.222, StdDeviation   =      130.552]
#[Max     =     1000.448, Total count    =         8979]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11426 requests in 1.00m, 788.34KB read
  Socket errors: connect 0, read 0, write 0, timeout 1678
  Non-2xx or 3xx responses: 31
Requests/sec:    190.37
Transfer/sec:     13.13KB


GET (128 connections)

wrk -t4 -c128 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  4 threads and 128 connections
  Thread calibration: mean lat.: 28.879ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 33.944ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 20.605ms, rate sampling interval: 42ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.34ms   62.60ms   1.00s    98.96%
    Req/Sec    36.31     48.51   219.00     80.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.38ms
 75.000%   20.61ms
 90.000%   21.36ms
 99.000%  139.26ms
 99.900%    1.00s 
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.271     0.000000            2         1.00
      20.335     0.100000         2456         1.11
      20.351     0.200000         4566         1.25
      20.351     0.300000         4566         1.43
      20.367     0.400000         6460         1.67
      20.383     0.500000         7603         2.00
      20.383     0.550000         7603         2.22
      20.399     0.600000         8356         2.50
      20.415     0.650000         8745         2.86
      20.447     0.700000         9195         3.33
      20.607     0.750000         9748         4.00
      20.703     0.775000        10058         4.44
      21.007     0.800000        10413         5.00
      21.311     0.825000        10811         5.71
      21.327     0.850000        11155         6.67
      21.343     0.875000        11549         8.00
      21.343     0.887500        11549         8.89
      21.359     0.900000        11845        10.00
      21.359     0.912500        11845        11.43
      21.375     0.925000        12071        13.33
      21.391     0.937500        12204        16.00
      21.407     0.943750        12301        17.78
      21.423     0.950000        12380        20.00
      21.439     0.956250        12439        22.86
      21.471     0.962500        12500        26.67
      21.551     0.968750        12564        32.00
      21.711     0.971875        12608        35.56
      21.935     0.975000        12644        40.00
      22.319     0.978125        12685        45.71
      22.879     0.981250        12723        53.33
      24.047     0.984375        12765        64.00
      25.295     0.985938        12784        71.11
      26.719     0.987500        12804        80.00
      32.095     0.989062        12825        91.43
     141.311     0.990625        12845       106.67
     354.559     0.992188        12871       128.00
     356.607     0.992969        12875       142.22
     462.335     0.993750        12886       160.00
     569.855     0.994531        12899       182.86
     576.511     0.995313        12906       213.33
     677.887     0.996094        12917       256.00
     684.031     0.996484        12921       284.44
     785.407     0.996875        12932       320.00
     785.407     0.997266        12932       365.71
     792.063     0.997656        12936       426.67
     892.927     0.998047        12947       512.00
     892.927     0.998242        12947       568.89
     892.927     0.998437        12947       640.00
     893.951     0.998633        12950       731.43
     897.535     0.998828        12951       853.33
    1000.959     0.999023        12964      1024.00
    1000.959     0.999121        12964      1137.78
    1000.959     0.999219        12964      1280.00
    1000.959     0.999316        12964      1462.86
    1000.959     0.999414        12964      1706.67
    1000.959     0.999512        12964      2048.00
    1000.959     0.999561        12964      2275.56
    1000.959     0.999609        12964      2560.00
    1000.959     0.999658        12964      2925.71
    1000.959     0.999707        12964      3413.33
    1000.959     0.999756        12964      4096.00
    1000.959     0.999780        12964      4551.11
    1000.959     0.999805        12964      5120.00
    1000.959     0.999829        12964      5851.43
    1001.983     0.999854        12966      6826.67
    1001.983     1.000000        12966          inf
#[Mean    =       26.342, StdDeviation   =       62.602]
#[Max     =     1001.472, Total count    =        12966]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15962 requests in 1.00m, 1.08MB read
  Socket errors: connect 0, read 0, write 0, timeout 2710
  Non-2xx or 3xx responses: 20
Requests/sec:    265.33
Transfer/sec:     18.35KB



+++++++++++++++++++++++++++++++++++++++++PUT + GET++++++++++++++++++++++++++++++++++++++++++++++++


75 connections


(PUT)

wrk -t4 -c75 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8083
Running 1m test @ http://localhost:8083
  4 threads and 75 connections
  Thread calibration: mean lat.: 39.107ms, rate sampling interval: 337ms
  Thread calibration: mean lat.: 42.194ms, rate sampling interval: 179ms
  Thread calibration: mean lat.: 37.180ms, rate sampling interval: 203ms
  Thread calibration: mean lat.: 44.280ms, rate sampling interval: 185ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.17ms   74.68ms   1.00s    98.58%
    Req/Sec    27.26      6.77   106.00     94.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.37ms
 75.000%    1.87ms
 90.000%    3.65ms
 99.000%  367.36ms
 99.900%  931.33ms
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.451     0.000000            1         1.00
       0.884     0.100000          555         1.11
       1.090     0.200000         1111         1.25
       1.201     0.300000         1667         1.43
       1.292     0.400000         2225         1.67
       1.368     0.500000         2774         2.00
       1.435     0.550000         3050         2.22
       1.553     0.600000         3328         2.50
       1.679     0.650000         3609         2.86
       1.788     0.700000         3882         3.33
       1.868     0.750000         4161         4.00
       1.915     0.775000         4298         4.44
       1.981     0.800000         4438         5.00
       2.101     0.825000         4576         5.71
       2.359     0.850000         4714         6.67
       2.867     0.875000         4852         8.00
       3.231     0.887500         4922         8.89
       3.647     0.900000         4991        10.00
       4.159     0.912500         5060        11.43
       4.771     0.925000         5130        13.33
       5.455     0.937500         5200        16.00
       5.819     0.943750         5234        17.78
       6.243     0.950000         5268        20.00
       6.955     0.956250         5303        22.86
       7.835     0.962500         5338        26.67
       9.223     0.968750         5372        32.00
       9.847     0.971875         5390        35.56
      11.151     0.975000         5407        40.00
      14.855     0.978125         5424        45.71
      22.671     0.981250         5442        53.33
      45.407     0.984375         5459        64.00
     145.407     0.985938         5468        71.11
     218.111     0.987500         5476        80.00
     300.543     0.989062         5485        91.43
     431.359     0.990625         5494       106.67
     507.647     0.992188         5502       128.00
     576.511     0.992969         5507       142.22
     645.119     0.993750         5511       160.00
     654.335     0.994531         5515       182.86
     718.847     0.995313         5520       213.33
     787.455     0.996094         5524       256.00
     789.503     0.996484         5526       284.44
     858.623     0.996875         5530       320.00
     858.623     0.997266         5530       365.71
     862.719     0.997656         5533       426.67
     929.791     0.998047         5535       512.00
     930.303     0.998242         5537       568.89
     930.303     0.998437         5537       640.00
     930.815     0.998633         5538       731.43
     931.327     0.998828         5539       853.33
    1000.959     0.999023         5543      1024.00
    1000.959     0.999121         5543      1137.78
    1000.959     0.999219         5543      1280.00
    1000.959     0.999316         5543      1462.86
    1000.959     0.999414         5543      1706.67
    1000.959     0.999512         5543      2048.00
    1000.959     0.999561         5543      2275.56
    1000.959     0.999609         5543      2560.00
    1001.471     0.999658         5544      2925.71
    1001.471     0.999707         5544      3413.33
    1001.471     0.999756         5544      4096.00
    1001.471     0.999780         5544      4551.11
    1001.471     0.999805         5544      5120.00
    1001.983     0.999829         5545      5851.43
    1001.983     1.000000         5545          inf
#[Mean    =       10.167, StdDeviation   =       74.677]
#[Max     =     1001.472, Total count    =         5545]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6681 requests in 1.00m, 437.47KB read
  Socket errors: connect 0, read 0, write 0, timeout 1855
  Non-2xx or 3xx responses: 38
Requests/sec:    111.25
Transfer/sec:      7.28KB


(GET)

 wrk -t4 -c75 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 75 connections
  Thread calibration: mean lat.: 43.735ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 82.257ms, rate sampling interval: 573ms
  Thread calibration: mean lat.: 76.369ms, rate sampling interval: 657ms
  Thread calibration: mean lat.: 61.032ms, rate sampling interval: 177ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.30ms  109.68ms   1.01s    96.83%
    Req/Sec    18.03      9.64    56.00     77.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.64ms
 75.000%   21.49ms
 90.000%   25.97ms
 99.000%  744.45ms
 99.900%    1.00s 
 99.990%    1.01s 
 99.999%    1.01s 
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.335     0.000000            6         1.00
      20.415     0.100000          665         1.11
      20.447     0.200000         1099         1.25
      20.479     0.300000         1531         1.43
      20.527     0.400000         2003         1.67
      20.639     0.500000         2439         2.00
      20.863     0.550000         2670         2.22
      21.375     0.600000         2958         2.50
      21.407     0.650000         3176         2.86
      21.439     0.700000         3413         3.33
      21.487     0.750000         3660         4.00
      21.535     0.775000         3763         4.44
      21.647     0.800000         3887         5.00
      21.951     0.825000         4003         5.71
      22.655     0.850000         4124         6.67
      23.759     0.875000         4245         8.00
      24.751     0.887500         4308         8.89
      25.967     0.900000         4366        10.00
      26.767     0.912500         4428        11.43
      28.511     0.925000         4488        13.33
      30.735     0.937500         4548        16.00
      33.951     0.943750         4579        17.78
      35.423     0.950000         4609        20.00
      39.391     0.956250         4639        22.86
      72.959     0.962500         4670        26.67
     178.047     0.968750         4700        32.00
     251.263     0.971875         4715        35.56
     333.567     0.975000         4730        40.00
     434.175     0.978125         4745        45.71
     509.183     0.981250         4761        53.33
     590.847     0.984375         4776        64.00
     641.023     0.985938         4784        71.11
     691.711     0.987500         4791        80.00
     742.911     0.989062         4798        91.43
     767.487     0.990625         4806       106.67
     802.303     0.992188         4814       128.00
     846.335     0.992969         4819       142.22
     848.895     0.993750         4821       160.00
     898.047     0.994531         4829       182.86
     898.047     0.995313         4829       213.33
     922.111     0.996094         4833       256.00
     949.247     0.996484         4837       284.44
     949.247     0.996875         4837       320.00
     949.759     0.997266         4839       365.71
     950.271     0.997656         4841       426.67
     971.263     0.998047         4842       512.00
    1000.959     0.998242         4848       568.89
    1000.959     0.998437         4848       640.00
    1000.959     0.998633         4848       731.43
    1000.959     0.998828         4848       853.33
    1000.959     0.999023         4848      1024.00
    1000.959     0.999121         4848      1137.78
    1000.959     0.999219         4848      1280.00
    1000.959     0.999316         4848      1462.86
    1001.471     0.999414         4849      1706.67
    1001.471     0.999512         4849      2048.00
    1001.471     0.999561         4849      2275.56
    1001.983     0.999609         4850      2560.00
    1001.983     0.999658         4850      2925.71
    1001.983     0.999707         4850      3413.33
    1001.983     0.999756         4850      4096.00
    1001.983     0.999780         4850      4551.11
    1012.735     0.999805         4851      5120.00
    1012.735     1.000000         4851          inf
#[Mean    =       40.296, StdDeviation   =      109.681]
#[Max     =     1012.224, Total count    =         4851]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6103 requests in 1.00m, 419.22KB read
  Socket errors: connect 0, read 0, write 0, timeout 1863
  Non-2xx or 3xx responses: 28
Requests/sec:    101.67
Transfer/sec:      6.98KB


128 connections 

(GET)

wrk -t4 -c128 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 128 connections
  Thread calibration: mean lat.: 28.825ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 26.779ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 26.106ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 25.353ms, rate sampling interval: 45ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.26ms   66.02ms   1.00s    98.84%
    Req/Sec    15.62     21.91    88.00     75.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.39ms
 75.000%   21.82ms
 90.000%   23.10ms
 99.000%  249.47ms
 99.900%    1.00s 
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.495     0.000000            1         1.00
      20.911     0.100000          334         1.11
      21.071     0.200000          658         1.25
      21.167     0.300000          961         1.43
      21.247     0.400000         1262         1.67
      21.391     0.500000         1575         2.00
      21.455     0.550000         1721         2.22
      21.503     0.600000         1876         2.50
      21.583     0.650000         2049         2.86
      21.663     0.700000         2184         3.33
      21.823     0.750000         2344         4.00
      21.919     0.775000         2421         4.44
      22.015     0.800000         2491         5.00
      22.159     0.825000         2571         5.71
      22.335     0.850000         2648         6.67
      22.671     0.875000         2724         8.00
      22.847     0.887500         2768         8.89
      23.103     0.900000         2803        10.00
      23.455     0.912500         2840        11.43
      23.871     0.925000         2879        13.33
      24.511     0.937500         2918        16.00
      24.959     0.943750         2937        17.78
      25.599     0.950000         2958        20.00
      26.159     0.956250         2976        22.86
      26.991     0.962500         2996        26.67
      27.951     0.968750         3015        32.00
      28.271     0.971875         3025        35.56
      28.799     0.975000         3035        40.00
      30.351     0.978125         3044        45.71
      32.527     0.981250         3054        53.33
      37.887     0.984375         3064        64.00
      47.935     0.985938         3069        71.11
      59.551     0.987500         3074        80.00
     142.847     0.989062         3078        91.43
     250.239     0.990625         3083       106.67
     358.399     0.992188         3088       128.00
     465.151     0.992969         3091       142.22
     571.903     0.993750         3093       160.00
     572.415     0.994531         3096       182.86
     679.935     0.995313         3100       213.33
     679.935     0.996094         3100       256.00
     787.455     0.996484         3104       284.44
     787.455     0.996875         3104       320.00
     787.455     0.997266         3104       365.71
     894.463     0.997656         3106       426.67
     894.463     0.998047         3106       512.00
     894.975     0.998242         3108       568.89
     894.975     0.998437         3108       640.00
     894.975     0.998633         3108       731.43
    1001.471     0.998828         3109       853.33
    1001.471     0.999023         3109      1024.00
    1001.983     0.999121         3111      1137.78
    1001.983     0.999219         3111      1280.00
    1001.983     0.999316         3111      1462.86
    1001.983     0.999414         3111      1706.67
    1001.983     0.999512         3111      2048.00
    1001.983     0.999561         3111      2275.56
    1001.983     0.999609         3111      2560.00
    1001.983     0.999658         3111      2925.71
    1002.495     0.999707         3112      3413.33
    1002.495     1.000000         3112          inf
#[Mean    =       28.265, StdDeviation   =       66.021]
#[Max     =     1001.984, Total count    =         3112]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3758 requests in 1.00m, 257.10KB read
  Socket errors: connect 0, read 0, write 0, timeout 3479
  Non-2xx or 3xx responses: 7
Requests/sec:     62.57
Transfer/sec:      4.28KB



(PUT)

wrk -t4 -c128 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8083
Running 1m test @ http://localhost:8083
  4 threads and 128 connections
  Thread calibration: mean lat.: 4.630ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 19.232ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.358ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.351ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.98ms   54.89ms   1.00s    99.23%
    Req/Sec    16.63     44.43     0.89k    86.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.03ms
 75.000%    2.75ms
 90.000%    4.26ms
 99.000%   24.11ms
 99.900%  877.05ms
 99.990%    1.00s 
 99.999%    1.00s 
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.737     0.000000            1         1.00
       1.523     0.100000          313         1.11
       1.643     0.200000          625         1.25
       1.752     0.300000          937         1.43
       1.874     0.400000         1247         1.67
       2.031     0.500000         1561         2.00
       2.129     0.550000         1716         2.22
       2.235     0.600000         1871         2.50
       2.373     0.650000         2028         2.86
       2.527     0.700000         2183         3.33
       2.747     0.750000         2338         4.00
       2.901     0.775000         2415         4.44
       3.071     0.800000         2493         5.00
       3.279     0.825000         2571         5.71
       3.487     0.850000         2649         6.67
       3.817     0.875000         2728         8.00
       4.063     0.887500         2767         8.89
       4.259     0.900000         2805        10.00
       4.559     0.912500         2844        11.43
       5.055     0.925000         2883        13.33
       5.651     0.937500         2922        16.00
       5.939     0.943750         2941        17.78
       6.519     0.950000         2961        20.00
       6.975     0.956250         2980        22.86
       7.711     0.962500         3000        26.67
       8.807     0.968750         3019        32.00
       9.431     0.971875         3029        35.56
      10.735     0.975000         3039        40.00
      12.231     0.978125         3048        45.71
      13.239     0.981250         3058        53.33
      16.335     0.984375         3068        64.00
      18.991     0.985938         3073        71.11
      20.623     0.987500         3078        80.00
      21.471     0.989062         3082        91.43
      26.383     0.990625         3087       106.67
      32.831     0.992188         3092       128.00
     120.767     0.992969         3095       142.22
     239.103     0.993750         3097       160.00
     364.287     0.994531         3099       182.86
     491.775     0.995313         3102       213.33
     498.687     0.996094         3104       256.00
     621.055     0.996484         3106       284.44
     625.151     0.996875         3107       320.00
     747.007     0.997266         3108       365.71
     748.543     0.997656         3109       426.67
     751.103     0.998047         3110       512.00
     873.983     0.998242         3111       568.89
     875.007     0.998437         3112       640.00
     875.007     0.998633         3112       731.43
     877.055     0.998828         3113       853.33
     877.055     0.999023         3113      1024.00
    1000.959     0.999121         3114      1137.78
    1000.959     0.999219         3114      1280.00
    1000.959     0.999316         3114      1462.86
    1001.471     0.999414         3115      1706.67
    1001.471     0.999512         3115      2048.00
    1001.471     0.999561         3115      2275.56
    1001.471     0.999609         3115      2560.00
    1001.471     0.999658         3115      2925.71
    1001.983     0.999707         3116      3413.33
    1001.983     1.000000         3116          inf
#[Mean    =        6.978, StdDeviation   =       54.888]
#[Max     =     1001.472, Total count    =         3116]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4475 requests in 1.00m, 293.41KB read
  Socket errors: connect 0, read 0, write 0, timeout 3364
  Non-2xx or 3xx responses: 75
Requests/sec:     74.46
Transfer/sec:      4.88KB